app/controllers/listings_controller.rb

  def index
    @listings = Listing.all
---
SELECT "listings".* FROM "listings" WHERE (user_id = 1)

  def create
    @listing = Listing.new(listing_params)
    # @listing = current_user.listings.build(listing_params)

    if @listing.save
---
INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Frye Boots"], ["description", "Brown Leather and Size 9"], ["price", "120.0"], ["created_at", "2017-09-30 14:09:30.804960"], ["updated_at", "2017-09-30 14:09:30.804960"], ["user_id", 1]]

  def update
    if @listing.update(listing_params)
---
UPDATE "listings" SET "name" = $1, "description" = $2, "price" = $3, "user_id" = $4, "updated_at" = $5 WHERE "listings"."id" = $6  [["name", "Frye Boots with pattern"], ["description", "Brown Leather and Size 9.5"], ["price", "126.0"], ["user_id", 1], ["updated_at", "2017-09-30 18:45:18.732541"], ["id", 7]]